       FD  ARCHIVO-CLIENTES.
           01 CLIENTES-REGISTRO.
              10 CLIENTES-ID PIC 9(6).
              10 CLIENTES-NOMBRE PIC X(25).
              10 CLIENTES-APELLIDO PIC X(35).
              10 CLIENTES-EDAD PIC 9(3).
              10 CLIENTES-TELEFONO PIC X(9).
              10 CLIENTES-DIRECCION PIC X(36).
